def get_great_text(score):
    if 2.0 <= score < 3.00: # не 2.99, защото ако въведем 2.999 ще ни върне None и не трябва да е и равно, а само по-малко,
        return 'Fail'       # така и в другите случаи
    if 3.0 <= score < 3.5:
        return 'Poor'
    if 3.5 <= score < 4.5:
        return 'Good'
    if 4.5 <= score < 5.5:
        return 'Very good'
    if 5.5 <= score < 6.00:
        return 'Excellent'


score = float(input())
print(get_great_text(score))

# Може вместо навсякъде да пишем ретърн, на местата на ретърн да
# да сложим променлива ресълд, но отгоре след def задължително трябва
# да кажем, че result ни е None, защото ако въведем стойност извън тези
# рейнджове ще ни даде грешка, че result не е дефинирана

# Когато навскяъде имаме result не ползвам elif, защото return прекратява
# действието на функцията, но когато ползвам result трябва да ползвам и elif